Revit 2024 API
AreaBasedLoadType Class
 This class represents an area based load type in Autodesk Revit.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public class AreaBasedLoadType : Element
Visual Basic
Public Class AreaBasedLoadType _
	Inherits Element
Visual C++
public ref class AreaBasedLoadType : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Electrical.AreaBasedLoadType
See Also
AreaBasedLoadType Members
Autodesk.Revit.DB.Electrical Namespace